{
  "comments": [
    {
      "date": "2005-08-31T10:52:24Z",
      "name": "mark",
      "comment": "A friend attached a \"roof\" to  his Recumbent Trike with good results. It was more for sun protection than rain, but it seemed to be useful. Not quite as sexy as a velomobile body to be sure. but you CAN build a body from \"Coroplast\" or \"Coroflute\" which is basically plastic corrugated material (like cardboard, but plastic) that will help protect you from weather and make the bike faster.\n\nmark"
    },
    {
      "date": "2005-10-11T05:47:24Z",
      "name": "Jim",
      "comment": "<a href=\"http://www.recumbents.com/mars/pages/proj/tetz/projtetzmain.html\">Build one yourself!</a>"
    },
    {
      "date": "2005-11-08T17:18:49Z",
      "name": "windchill",
      "comment": "Search for Full Fairings and you will find what you are looking for. I once was researching human powered vehicles and kept coming across the word fairing and didn't have a clue what it meant. I eventually found out that they were bike coverings. Partial Fairings are like wind screens and full fairings cover the entire bike. there are manufacturers like Zzip and also examples of home made ones. They are usually made out of tent-like material."
    },
    {
      "date": "2006-01-18T09:27:32Z",
      "name": "forest",
      "comment": "<a href=\"http://www.alternatives.com/ultimate/enter.html\">This looks close</a> to what you are looking for"
    },
    {
      "date": "2006-04-02T06:31:57Z",
      "name": "Markus Demarkus",
      "comment": "I took a P500 Meridia electric bike and built a monokote shell over it. I use it for eye catching at our political rallies while fighting the toll roads and petitioning in Texas. The front acrylic windshield deflects rain droplets around the rider. Visibility in rain is good because the windshield angle is too sharp for droplets to stay. It is wonderful protection against the sun. Wind is no problem.\n\nIt is not powerful enough to easily go up sharp hills (like where I live), so I am planning another version using a more powerful motor and a few more gears. I am drawing up plans so people can build it themselves if they are handy. Another version to be fitted on a typical bike.\n\nBicycles will soon be king in Texas since people are moving closer to work to avoid the toll road hell coming our way. Foolish short-sighted politicians.\n\nEmail me for pictures."
    },
    {
      "date": "2006-07-19T20:21:09Z",
      "name": "Bevan",
      "comment": "Hi there Markus\n\nI am keen to see your pictures of the canopy you made.\n\nKind Regards\n\n<p>Bevan<br>Auckland<br>New Zealand</p>"
    },
    {
      "date": "2006-10-09T10:04:23Z",
      "name": "Robby",
      "comment": "I currently have an Ezee Sprint electric bike and I'm looking to either cover it for rain riding, or get another similar electric powered but enclosed vehicle for riding around NYC traffic. Please send photos!"
    },
    {
      "date": "2006-10-19T07:00:23Z",
      "name": "Jason Fell",
      "comment": "Pics for me too? Thanks.\n\n<p>Jason Fell<br>Boulder, CO</p>"
    },
    {
      "date": "2006-11-26T00:19:35Z",
      "name": "greg snider",
      "comment": "Hello Markus, I am interested in what you devised- I put a front fairing on my burley koosah and would like to extend over the top. Need to know where to purchase material and a few ideas on the build would be great. If you have a photo available please feel free to email me. Thanks, Greg Snider (Gizmo)"
    },
    {
      "date": "2007-01-13T10:27:22Z",
      "name": "Mary Arneson",
      "url": "http://www.velomobiling.com",
      "comment": "We have several velomobile project descriptions hosted on <a href=\"http://www.velomobiling.com/gallery/Velomobile1/projects/\">our Home-Builder Gallery pages</a> at Velomobiling.net / Velomobiling.com .  See also <a href=\"http://sports.webshots.com/album/556581441oVNuFf\">this lovely Coroplast project</a>, which was discussed on Bentrideronline."
    },
    {
      "date": "2007-01-13T16:53:31Z",
      "name": "James M. DeVone, Sr.",
      "url": "http://www.maxpages.com/devonemfgco75",
      "comment": "<a href=\"http://www.maxpages.com/devonemfgco75\">There is a bicycle canopy</a> (copyrighted) that was invented in the 1970's. This product appeared in the Durham Herald-Sun, Durham, NC, Tuesday, Oct. 14, 1975, Page B-1, and the Greensboro Daily News, Page B-3, both daily newspapers, as well as in a national magazine. The United States patent was granted on Aug. 30, 1977, U.S patent no. 4, 045,077 (inventor: James DeVone). In addition, several foreign patents have been applied for.\n\nIf anyone would like to acquire a licence to make, use, sell and advertise this product, contact: <a href=\"mailto:james_devone@yahoo.com\">James M. DeVone, Sr.</a>, POB 51216-2916, Durham, NC 27717 USA."
    },
    {
      "date": "2009-01-23T20:12:08Z",
      "name": "Beaverguide",
      "comment": "I too have the same problem with the weather. The best I could find <a href=\"http://www.cab-bike.com/\">was this site</a>.\n\nI haven't got one yet though.\n\naa"
    },
    {
      "date": "2009-05-14T02:46:52Z",
      "name": "Isabel Bel",
      "comment": "My boyfriend designed and had a custom \"bike cover\" made and installed on his Grandfather's electric bike. It's the funniest looking thing I have ever seen and is basically a bubble on top of a bike. It does not offer protection for the feet but pretty much covers everything else. Maybe he can design one for you if you still haven't found a solution to your problem.\n\nChiga Cheowww"
    },
    {
      "date": "2009-07-22T04:50:00Z",
      "name": "jack33",
      "comment": "I ride my bike all year round, and since I live in Canada that means I have to bundle up quite a bit in the winter! When temperatures dip below 5 Celsius or so, I put my \"summer\" helmet back on the shelf and reach for my custom modified all-weather helmet. It's so effective that despite my mostly bald head I don't need to wear a hat underneath, even at temperatures down to -20C at speeds in excess of 40 km/h (tested and confirmed!)\n\nThe All-Weather Helmet is also completely waterproof, so it's great to have when it's raining, sleeting, or snowing.\n\nVirtually any helmet can be modified into an all-weather helmet, the only requirement is that the plastic decorative shell can be removed."
    },
    {
      "date": "2009-10-08T03:27:44Z",
      "name": "TeixeiraMarco",
      "comment": "I have looked for it sometime ago. I do agree that it's a hard work,  but yes it really exists !! take a look at:\n\n<a href=\"http://www.velotop.com/\">velotop</a>\n\nand\n\n<a href=\"http://www.veltop.com\">veltop</a>\n\nRegards"
    }
  ]
}
