{
  "comments": [
    {
      "date": "2005-08-31T10:52:24Z",
      "name": "mark",
      "comment": "A friend attached a \"roof\" to  his Recumbent Trike with good results. It was more for sun protection than rain, but it seemed to be useful. Not quite as sexy as a velomobile body to be sure. but you CAN build a body from \"Coroplast\" or \"Coroflute\" which is basically plastic corrugated material (like cardboard, but plastic) that will help protect you from weather and make the bike faster.\n\nmark"
    },
    {
      "date": "2005-10-11T05:47:24Z",
      "name": "Jim",
      "comment": "<a href=\"http://www.recumbents.com/mars/pages/proj/tetz/projtetzmain.html\">Build one yourself!</a>"
    },
    {
      "date": "2005-11-08T17:18:49Z",
      "name": "windchill",
      "comment": "Search for Full Fairings and you will find what you are looking for. I once was researching human powered vehicles and kept coming across the word fairing and didn't have a clue what it meant. I eventually found out that they were bike coverings. Partial Fairings are like wind screens and full fairings cover the entire bike. there are manufacturers like Zzip and also examples of home made ones. They are usually made out of tent-like material."
    },
    {
      "date": "2006-01-18T09:27:32Z",
      "name": "forest",
      "comment": "<a href=\"http://www.alternatives.com/ultimate/enter.html\">This looks close</a> to what you are looking for"
    },
    {
      "date": "2006-04-02T06:31:57Z",
      "name": "Markus Demarkus",
      "comment": "I took a P500 Meridia electric bike and built a monokote shell over it. I use it for eye catching at our political rallies while fighting the toll roads and petitioning in Texas. The front acrylic windshield deflects rain droplets around the rider. Visibility in rain is good because the windshield angle is too sharp for droplets to stay. It is wonderful protection against the sun. Wind is no problem.\n\nIt is not powerful enough to easily go up sharp hills (like where I live), so I am planning another version using a more powerful motor and a few more gears. I am drawing up plans so people can build it themselves if they are handy. Another version to be fitted on a typical bike.\n\nBicycles will soon be king in Texas since people are moving closer to work to avoid the toll road hell coming our way. Foolish short-sighted politicians.\n\nEmail me for pictures."
    },
    {
      "date": "2006-07-19T20:21:09Z",
      "name": "Bevan",
      "comment": "Hi there Markus\n\nI am keen to see your pictures of the canopy you made.\n\nKind Regards\n\n<p>Bevan<br>Auckland<br>New Zealand</p>"
    },
    {
      "date": "2006-10-09T10:04:23Z",
      "name": "Robby",
      "comment": "I currently have an Ezee Sprint electric bike and I'm looking to either cover it for rain riding, or get another similar electric powered but enclosed vehicle for riding around NYC traffic. Please send photos!"
    },
    {
      "date": "2006-10-19T07:00:23Z",
      "name": "Jason Fell",
      "comment": "Pics for me too? Thanks.\n\n<p>Jason Fell<br>Boulder, CO</p>"
    },
    {
      "date": "2006-11-26T00:19:35Z",
      "name": "greg snider",
      "comment": "Hello Markus, I am interested in what you devised- I put a front fairing on my burley koosah and would like to extend over the top. Need to know where to purchase material and a few ideas on the build would be great. If you have a photo available please feel free to email me. Thanks, Greg Snider (Gizmo)"
    }
  ]
}
