{
  "comments": [
    {
      "date": "2015-03-01T17:33:41Z",
      "name": "Barry White",
      "comment": "Everyone would like a Very Fast Train service between Brisbane, Sydney &amp; Melbourne. However the construction costs are out of our reach. Also it is too late. With the short lifetime expected for airlines there will be a need for a much better rail system than we now have. I propose the \"Fast Enough Railway\".\n\nWhen the existing lines were laid down they used horses and scoops for earth moving. They had to go around even small hills instead of straight through in cuttings. By straightening the line between Sydney and Wagga, and Sydney and Brisbane together with bringing the track up to best UK standards, we could, using the same trains, the NSW XPTs, acheive speeds up to and perhaps a little over 125 MPH (200kph). The XPTs are the same design as the 125s used by UK rail on their mainline services.\n\nThose of you who have not travelled on the UK East Coast line, <a href=\"http://tinyurl.com/oduscte\">these</a> <a href=\"http://tinyurl.com/kkmoxn9\">videos</a> <a href=\"http://tinyurl.com/lhd9k9t\">will</a> give you an idea of what is possible. Most of the non electric trains are the 125s (XPTs).\n\nI believe we can afford this and it will become urgent."
    },
    {
      "date": "2015-07-31T04:37:52Z",
      "name": "Bazza",
      "comment": "I think that all those projects are necessary in the long term. Some more urgent than others. For instance the east coast high speed rail line. It is critical for the future of the 3 major cities and for urban growth to move elsewhere along the HSR corridor than keep straining the major centers. By 2030 Sydney and Melbourne are touted to be well beyond 6 million each. And as housing affordability stands today things look very grim unless spreading to other regional centers.\n\nI envisage that after HSR is proven to benefit countless aussies in rural Australia, we would see a renaissance in rail construction follow. Lines extended from Brisbane to the sunshine coast and beyond to Cairns. And even west of Melbourne to Geelong, Mount Gambier and finally Adelaide. It is during this time I can see justification for an Adelaide to Perth high speed rail line with desert cities built as commercial nodes along its route. This would be modelled on the successes of green energy examples like the new Masdar city in Qatar as well as Dubai as a blueprint for sustainable city living.\n\nDuring this time and with megaprojects around the world namely China accelerating, we can begin to imagine a project like the 200km Victoria to Tasmania tunnel. But it would definitely need to be High Speed Rail. This would inject much needed growth to the state of Tasmania as it would provide for the first time a viable commute corridor for Tasmanians and Victorians alike. Hopefully it can happen not long after the many projects already mentioned. My guess is after HSR is built in the 2020s and 2030s."
    }
  ]
}
