{
  "comments": [
    {
      "date": "2022-11-07T12:24:26.237Z",
      "name": "Keith Lyons",
      "comment": "What a stupid pathetic idea.\n\nHow many people will hop on a bicycle and ride it?\n\nYep, that's right - Buckleys and none."
    },
    {
      "date": "2022-12-01T19:58:34.195Z",
      "name": "Paul McCann",
      "comment": "The article is full of incorrect facts. The line was not completely closed in 1988. Freight and heritage trains ran to Dumaresq up to around 2002. Tourist trains run between Warwick and Wallangarra most months not every \"blue moon\" as they claim. And there are plans to have trains return to the tracks and there is a significant number of local residents that support that option."
    },
    {
      "date": "2022-12-01T20:09:46.719Z",
      "name": "Jason",
      "comment": "There is no overwhelming community support for the rail trail aka bike track and majority of residents want rail services reinstated north of Armidale. The current petition has nearly 9000 signatures and with both commercial and heritage rail operators interested in using the line again this will surely take priority over some bike track."
    },
    {
      "date": "2022-12-02T00:46:47.058Z",
      "name": "Robert Lee",
      "comment": "Trains to Wallangarra run from Warwick every few weeks for about nine months a year. And they're all steam hauled! The Southern Downs Railway is the operator. That's definitely not \"once in a blue moon\". The Queensland line remains open for use by the Army as well.\n\nClosure of this railway was one of the many absurdities of the 1980s and 1990s. However, it is true that the population is quite small. Glenn Innes and Tenterfield are the only decent-sized towns and I doubt they generate enough traffic to justify keeping the railway open for passenger traffic. It really needs a nice big mine to produce enough traffic to justify reopening, preferably something desirable like copper, tin (previously mined at Tenterfield, hence Stannum House) or lithium.\n\nBy comparison, the closed Casino to Murwillumbah branch serves some of the largest regional cities and traffic generators in the state and road congestion is ghastly, which isn't exactly true of Guyra for instance. Its continued closure is a huge scandal. Both Labor and the Coalition are complicit so, as a Northern Rivers resident, neither will get my vote in the next state election for precisely this disgraceful behaviour towards our railways."
    },
    {
      "date": "2022-12-02T11:44:00.123Z",
      "isAuthorReply": true,
      "comment": "Thanks for your comments, Paul, Jason and Robert. Re: some trains continuing to run north to Dumaresq until 2002, and some trains still running south to Wallangarra every few weeks. Thanks for the info &ndash; I just wrote this article based on the sources that I managed to find, which provided scant detail on those points. I have no problem with standing corrected.\n\nAssuming that what you say is true, and that there's decent community demand and decent (estimated) passenger / freight demand to justify reinstating rail services, then I too am in favour of reopening the line, rather than converting it into a bike track. My singing the praises of the bike track proposal, was based on the understanding that there's no hope of the line ever reopening."
    },
    {
      "date": "2022-12-02T19:11:06.133Z",
      "name": "Paul McCann",
      "comment": "The railway between Werris Creek and Wallangarra should be kept open as an alternative route for the Inland Railway during major flood events. The Inland Railway crosses several flood plains between Narromine and Toowoomba which are prone to regular flooding. The black soil is also not a good base to build railways and main highways on. The railways and highways around Moree have been closed several times since 2020 by major flood events and that is likely to be a regular occurrence in the future."
    },
    {
      "date": "2023-10-26T07:39:52.633Z",
      "name": "Jim Snow",
      "comment": "The latest rail line built near me has an excellent bikeway alongside it &ndash; same for latest major highways near me (Redcliffe, Queensland) &ndash; I use both regularly and see no problem with them being co-located &ndash; maybe a solution and it would be super handy to be able to use the trains to do parts of the trail, return trips, etc."
    },
    {
      "date": "2024-05-27T22:30:05.160Z",
      "name": "Ferguson ",
      "comment": "Nice article. There is a huge number of the community in New England that support a Rail Trail. Best it be restored for some kind of use than left to deteriorate further. I've seen trees growing in between the tracks. By establishing a Rail Trail helps gain access to the corridor and if one day the Govt has the funds to reinstate the Trains they can. "
    },
    {
      "date": "2024-08-15T21:02:58.037Z",
      "name": "John M W King",
      "comment": "Do uno when 5367 did its last steam tour from Tenterfield to wallangarra as I was on that up and back. I'm glad I filmed it.\n\nJohn M W King rail historian buff user supporter."
    }
  ]
}
