{
  "comments": [
    {
      "date": "2022-11-07T12:24:26.237Z",
      "name": "Keith Lyons",
      "comment": "What a stupid pathetic idea.\n\nHow many people will hop on a bicycle and ride it?\n\nYep, that's right - Buckleys and none."
    },
    {
      "date": "2022-12-01T19:58:34.195Z",
      "name": "Paul McCann",
      "comment": "The article is full of incorrect facts. The line was not completely closed in 1988. Freight and heritage trains ran to Dumaresq up to around 2002. Tourist trains run between Warwick and Wallangarra most months not every \"blue moon\" as they claim. And there are plans to have trains return to the tracks and there is a significant number of local residents that support that option."
    },
    {
      "date": "2022-12-01T20:09:46.719Z",
      "name": "Jason",
      "comment": "There is no overwhelming community support for the rail trail aka bike track and majority of residents want rail services reinstated north of Armidale. The current petition has nearly 9000 signatures and with both commercial and heritage rail operators interested in using the line again this will surely take priority over some bike track."
    },
    {
      "date": "2022-12-02T00:46:47.058Z",
      "name": "Robert Lee",
      "comment": "Trains to Wallangarra run from Warwick every few weeks for about nine months a year. And they're all steam hauled! The Southern Dawns Railway is the operator. That's definitely not \"once in a blue moon\". The Queensland line remains open for use by the Army as well.\n\nClosure of this railway was one of the many absurdities of the 1980s and 1990s. However, it is true that the population is quite small. Glenn Innes and Tenterfield are the only decent-sized towns and I doubt they generate enough traffic to justify keeping the railway open for passenger traffic. It really needs a nice big mine to produce enough traffic to justify reopening, preferably something desirable like copper, tin (previously mined at Tenterfield, hence Stannum House) or lithium.\n\nBy comparison, the closed Casino to Murwillumbah branch serves some of the largest regional cities and traffic generators in the state and road congestion is ghastly, which isn't exactly true of Guyra for instance. Its continued closure is a huge scandal. Both Labor and the Coalition are complicit so, as a Northern Rivers resident, neither will get my vote in the next state election for precisely this disgraceful behaviour towards our railways."
    }
  ]
}
