{
  "comments": [
    {
      "date": "2013-11-19T07:30:53Z",
      "name": "garry",
      "url": "http://www.vikingsacrossafrica.webs.com/",
      "comment": "Hi.\n\nEarlier this year we drove from Reykjavik to Capetown via west Africa (and a couple of ferries) in an Ex British army truck with 17 people.\n\nIn 2015 we will do the trip again and after drive the truck up the east of Africa from Cape to Cairo ... probably will take 5 months from Cape to Cairo.\n\nLike your info on the current state of the rail network ... I think I saw a documentary a couple of years ago of an African American father and daughter who took the train all the way (well most).\n\nI can testify that Africa is a very difficult continent to cross, not just with transport and non existent road and rail conections but politically with visa ... we only just made it across Africa with the visa situations, and I think in 1976 it would have been impossable in Uganda and South Sudan."
    },
    {
      "date": "2015-07-26T14:46:41Z",
      "isAuthorReply": true,
      "comment": "Update: I recently watched an excellent British-made documentary series (which was shown here on Aussie TV), <a href=\"http://www.abc.net.au/tv/programs/slow-train-through-africa-with-griff-rhys-jones/\">Slow Train Through Africa with Griff Rhys Jones</a>. The narrator travels through many of the key legs of the Cape to Cairo that I covered in this article, particularly Kenya / Tanzania (where he confirmed first-hand the neglect and disrepair of the Moshi to Voi line), Zambia / Zimbabwe (including a visit to the Bulawayo Train Museum, and to Rhodes's grave in Matopos National Park), and South Africa (where he continues south from Cape Town to Simon's Town, which is the southern-most train station in all of Africa). Also a very interesting tour of some of Africa's other railways, including Morocco / Algeria (where the orignal French-built network is still mainly in a good state), and Namibia (where one of Africa's newest and shiniest railway lines is surprisingly bereft of passengers, as the railways in Namibia are almost entirely used for mining cargo). I can't recommend this series enough!"
    }
  ]
}
