{
  "comments": [
    {
      "date": "2014-09-23T20:16:36Z",
      "name": "Juan",
      "comment": "Amazing work thank you so much.\n\nI have a list of suburbs that I am using together with your table. I can send it to you. Let me know.\n\nCheers - Juan"
    },
    {
      "date": "2014-10-11T07:53:06Z",
      "name": "Jeremy",
      "comment": "Thanks so much for this. Very clear explanation - which helps to qualify the data. And great explanation on how to replicate the process if needed. Thanks again."
    },
    {
      "date": "2014-10-17T11:08:24Z",
      "name": "Winzar",
      "comment": "Thank you, Jeremy,\n\nI was having a dreadful time trying to get some LGA data into Tableau as a personal exercise, but I have not programming skills at all and the python script I was given was all messed up.\n\nThis file has helped me a great deal."
    },
    {
      "date": "2014-11-12T16:08:17Z",
      "name": "Rachel",
      "comment": "Life saver thankyou! Just what I needed for a tender :)"
    },
    {
      "date": "2015-01-08T16:26:01Z",
      "name": "Neil",
      "comment": "You are the best."
    },
    {
      "date": "2015-02-24T13:46:46Z",
      "name": "vealmince",
      "comment": "Some pivot table goodness:\n\n<ul>\n<li>40% of postcodes are contained in a single LGA, the rest cross multiple LGAs.</li>\n<li>The average LGA covers 12 postcodes (the median is 10).</li>\n<li>Brisbane LGA covers 90 postcodes.</li>\n<li>Postcode 4871 is included in 19 LGAs: Aurukun, Cairns, Carpentaria, Cassowary Coast, Charters Towers, Cook, Croydon, Etheridge, Flinders, Hope Vale, Kowanyama, Lockhart River, McKinlay, Mornington, Napranum, Pormpuraaw, Richmond, Tablelands, Yarrabah.</li>\n<li>Only 10 LGAs comprise a single postcode: Palm Island, Tiwi Islands, Weipa, Mornington, Pormpuraaw, Mapoon, Torres Strait Island, Deniliquin, Broken Hill, King Island.</li>\n</ul>"
    },
    {
      "date": "2015-04-21T10:25:17Z",
      "name": "G",
      "comment": "Hi,\n\nThis is brilliant, just what I was looking for.\n\nJust one question, though: some postcodes are in more than one LGA. How do you select the appropriate one?"
    },
    {
      "date": "2015-04-21T10:39:16Z",
      "isAuthorReply": true,
      "comment": "@G. Re: \"some postcodes are in more than one LGA. How do you select the appropriate one?\" Well, that's the whole point - many of those postcodes really do belong to multiple LGAs. Officially and on the ground. So, for those postcodes, there is no \"appropriate one\", there's only an \"appropriate many\".\n\nIf you have more information, e.g. an exact street address, which yields a geographical point (not an area), then you can of course always map that to a single LGA. But with just a postcode, all you have is a (possibly large) geographical area, which may overlap with the areas of multiple LGAs."
    },
    {
      "date": "2015-06-18T12:08:22Z",
      "name": "Liz",
      "url": "http://www.fosteringnsw.com.au/",
      "comment": "Thanks so much, this is brilliant! I wonder why there is no official doc of this info available??"
    },
    {
      "date": "2017-02-17T12:21:39Z",
      "isAuthorReply": true,
      "comment": "UPDATE: due to a request that I received, I've created a new spreadsheet based on the latest ABS data sets (released in 2016). You can now access the new file <a href=\"https://docs.google.com/spreadsheets/d/1oRgqNZ8CJ4G9otnAr1x6CgSuYolzC1chud9kRpjmofM\">Australian LGA postcode mappings (2016 data)</a>. Main changes, as far as I can see: areas that have no LGA are now included (listed as \"Unincorporated\"), including all of the ACT; the controversial NSW council amalgamations have happened, and this is now reflected in the data sets.\n\nAlso, when trying to generate the new mapping with PostGIS, I got an \"ERROR: GEOSIntersects: TopologyException: side location conflict\" for the polygons for the Circular Head LGA / the 7330 postcode in Tasmania. So, I excluded these problem areas from the auto-generated mapping, and per the info at http://www.geopostcodes.com/Circular_Head (and a few other similar web sites), I manually added \"Tasmania,Circular Head,7321\", \"Tasmania,Circular Head,7330\", and \"Tasmania,Circular Head,7331\" to the spreadsheet."
    },
    {
      "date": "2022-05-31T06:30:00Z",
      "name": "Ben",
      "comment": "Hello,\n\nI stumbled on your website and the good work you did on Australian LGA postcode mappings (2016 data) while looking for a list with postcode, suburb, LGA and regions appended.\n\nWould you know where i can find this?\n\nThanks Ben"
    },
    {
      "date": "2022-05-31T06:48:00Z",
      "isAuthorReply": true,
      "comment": "Hi Ben,\n\nRe: a list of postcodes, suburbs, and LGAs. No, sorry, I'm not aware of such a list. However, the ABS does publish suburbs geospatial data, same as it does for postcodes and LGAs, so it should be possible to generate a postcode-to-suburb mapping, or an LGA-to-suburb mapping, or even a three-way postcode-LGA-suburb mapping, similar to the postcode-to-LGA mapping that I generated."
    },
    {
      "date": "2022-05-31T06:57:00Z",
      "name": "Ben",
      "comment": "I've been on both ABS and Auspost sites and nothing as clear as yours unfortunately!"
    },
    {
      "date": "2022-08-24T06:06:31.470Z",
      "name": "Emma Linton",
      "comment": "What an absolute legend! Thank you SO much for this. I work for a non profit and we would have needed to have spent hours to collate this data. Much appreciated 🙏"
    },
    {
      "date": "2023-02-13T04:46:14.006Z",
      "name": "David Luckett",
      "comment": "Hi Jeremy,\n\nThanks for all your work putting this data together.\n\n<a href=\"https://www.abs.gov.au/AUSSTATS/abs@.nsf/39433889d406eeb9ca2570610019e9a5/f5ffe838cbbf4dd3ca25730c0000a90a!OpenDocument\">This ABS dataset</a> is also noteworthy and relevant.\n\nIt gives &quot;concordances&quot; between LGAs and postcodes in CSV format.\n\nThe data is quite old (2006), so before any NSW LGA amalgamations, but it does provide an estimate of the population split across LGA boundaries."
    }
  ]
}
