{
  "comments": [
    {
      "date": "2015-09-17T01:52:30Z",
      "name": "colin holloway",
      "comment": "What a good read! David Adam's documentary is just airing on Freeview over here, UK. Thanks for your research. I wonder what the effect of the post glacial 'flood' had on the factual history and geography of the middle-eastern area through to the bronze-age?\n\nCRH"
    },
    {
      "date": "2016-01-19T14:39:01Z",
      "name": "Alan Ingram Phillips",
      "comment": "Just warm encouragement from me over my joyous reading of your blog about Adams' Oxus forage - particularly its serious tone.\n\nAdams' show is currently on NZ TV Choice which led me to Greenash (a well loved and historically significant tree in my homeland of Wales).\n\nI too would like to go to the Oxus area but my Chinese wife wants to see Europe so Pompeii will have to do for now!"
    },
    {
      "date": "2016-01-20T09:15:31Z",
      "name": "Huma Khanum",
      "comment": "I just read your article on the lost realms of the Oxus and got totally absorbed in it. I am also terribly fascinated by the ancient cultures of Central Asia and would love to visit some places some day, but difficulties of travel are a stumbling block. Not only are many of these places off the beaten track in today's world, but also many of our fairy tales and epic stories in literature are based in or make references to places in this region. So for me it also has a fairytale-ish quality.\n\nCongratulating you on writing this fascinating article."
    },
    {
      "date": "2017-03-10T11:10:01Z",
      "name": "Andrew Fryer",
      "comment": "I've been reading this article and watching David Adams for the first time. You probably have no further interest in the matter, but I was looking for his Zariaspa on GoogleEarth, and I think it is worse than you suspected. Rather than between Termez and Aiwanj, Adams says they drive south from Balkh, and sure enough, his ravine (all 0.9 miles of it) seems to be about 15 miles South of the city, and his twin cities are either side of the river just before you enter the ravine.\n\nLocation 36°33'20.81\"N, 66°58'32.01\"E\n\nHis \"Bactra\" is of course smaller than the cities he rejects for being too small. GoogleEarth's definition is not yet quite good enough to pick out his Zariaspa, unfortunately. I'm being more polite than I'd be about him in conversation! Cheers! (I mean - he thinks that after the sea rose after the ice age it descended again?)"
    },
    {
      "date": "2017-10-13T12:51:26Z",
      "name": "Steven",
      "comment": "I am not sure if you keep your blog updated, and this is really a rather minor thing, but I wanted to say that Kampyr Tepe is now easily accessible despite being on the border with Afghanistan. I write a travel guide about Central Asia and since your page pops up high in Google when searching for Kampyr Tepe, I thought I'd let you know to insure the maximum number of people get the right info!\n\nBTW, very impressed with your knowledge of the area without, it seems, ever visiting. Congratulations! My <a href=\"http://caravanistan.com/uzbekistan/south/termez/kampyr-tepe/\">page on Kampyr Tepe</a> is here."
    }
  ]
}
