{
  "comments": [
    {
      "date": "2006-06-13T04:34:29Z",
      "name": "Sami Khan",
      "url": "http://www.samikhan.org",
      "comment": "Neo dies initially in the Matrix, as far as I can remember, and the entire Matrix is an illusion of the mind created to keep the system going. If the mind decides that something is real, then it is real, that is because the matrix is an artificial world with rules that are directly linked to the mind's understanding of those rules. If you decide you are dead, you are dead; it's as simple as that. Somehow, it's linked in with physiological changes, as he spews blood when he's being beaten up &ndash; which again doesn't make sense, because in order for him to spew blood he must have some hemorrhaged veins or arteries. According to the Matrix logic, his brain would be causing these hemorrhages, and as far as I know this doesn't happen to human beings. However, I have heard of some girls wanting babies so bad that they get their bodies, without conception, to go into pregnancy &ndash; without actually being pregnant. The point is that if you don't believe in those rules, then they don't affect you -- but perhaps that's too shallow.\n\nFurthermore, the Matrix itself is built to accommodate \"the one\", for it's the only way that the machines can keep their system running. The whole movie's plot is about causality and all of the other things that do happen are at best arbitrary to the actual system that's running throughout the plot of the movie &ndash; that's the point, all the love and emotions and symbolism really mean nothing, it's just a side-effect of the system. Going back to the point, the Matrix is actually designed to allow \"the one\" to break the rules. To me Neo's initial death is simply due to causality, made to simply propel the system forward; it's the point at which he discovers his true abilities: death and rebirth. He can't possibly be killed by Agent Smith, for that would stop the system in mid-step and the system is out of equilibrium without what Neo does. my few cents."
    },
    {
      "date": "2006-06-15T00:57:23Z",
      "name": "Tim",
      "url": "http://www.whereelse.ca",
      "comment": "I never really questioned that Neo's Lazarus trick should be a problem. It pretty well fit in with his blooming realizations about the Matrix and its increasingly tenuous influence on his physical being. When you think about, his resurrection was a necessary step before reviving Trinity and then Smith and Neo transcending the boundary between their physical and logical selves."
    }
  ]
}
