{
  "comments": [
    {
      "date": "2010-12-22T02:12:46Z",
      "name": "Mauro",
      "url": "http://twitter.com/MMSalvatierra",
      "comment": "Hey guy this is a great article! I came here before visiting Drupal site and your job is amazing! Congratulations for all!\n\nNow I comment about the article: It's great! I feel a little interested about the title so i decide to read it at all. The \"mestizo\" part is really interesting it also happen in all Latin America.\n\nSorry if I have mistakes. My English isn't perfect.\n\nGood luck and un abrazo fuerte! (XOXOXO)\n\nMauro S, Desarrollador PHP. Buenos Aires, Argentina."
    },
    {
      "date": "2011-06-29T21:13:10Z",
      "name": "morg",
      "comment": "Next time you say dad or mum (father and mother are of Germanic origin) just note that you are speaking British (Welsh) and there are more than a few other examples. There is also a good case to say that the peculiarly ungermanic nature of the grammar of \"English\" is because it is the old British language, of which Welsh is a surviving dialect, relexicalised with words of other origins and grammatically evolved over time.\n\nWhat Oppenheimer's research suggests is that the Germanic settlers were relatively few in number, but large in political influence. The archeological evidence suggests that continental germanic incursions began with peaceful trading followed by conquest after considerable cultural alignment had already taken place in the South.\n\nIt's no surprise that we British, particularly the ones who live in the subjugated area called England, have been conned into thinking that we are Germans. How many German dynasties have we been ruled by, right up to the present day?\n\nOf course the ruling germanic monarchs have wanted us to see ourselves as germanic, and their propagandists have done a damn good job of picking up where Bede left off in convincing us that we are a bunch of germanic expats.\n\nYour article shows just how good a job has been done; but to your credit, considering the lack of linguistic knowledge that you possess, you have achieved some balance within the limits of your knowledge."
    }
  ]
}
