{
  "comments": [
    {
      "date": "2012-01-02T17:31:04Z",
      "name": "Fred Schreiner",
      "comment": "Hello Jeremy,\n\nThank you much for the work you have done documenting the Chile-Argentina border crossings - I have benefited greatly from this information in pursuit of routes on <a href=\"http://www.Schreiner.ca/CP.htm\">my planned tour</a>.\n\n<p>Fred Schreiner<br>Edmonton AB Canada</p>"
    },
    {
      "date": "2012-02-02T07:35:34Z",
      "name": "Charles Patchett",
      "comment": "Jeremy,\n\nWe are planning a driving trip in October, which will involve 5 crossings of the Chile/Argentina border. With a limited no. of pages left in my passport, can you advise whether the authorities need to stamp a clean page for each crossing?\n\nThanks in anticipation.\n\nCharles Patchett"
    },
    {
      "date": "2012-03-12T14:10:36Z",
      "name": "Brad Cougle",
      "url": "http://www.thelifeofbrad.blogspot.com/",
      "comment": "Thanks for the work. Probably saved me a lot of frustration at the Paso Agua Negra crossing. I do Jama instead even though it puts me in Chile longer I get to hit their desert.\n\nlost in transportation,\n\nBrad"
    },
    {
      "date": "2012-04-01T01:43:31Z",
      "name": "Russell",
      "url": "http://pikipikisafari.net/",
      "comment": "Great article, it's saved me a lot a time researching. Thanks for sharing."
    },
    {
      "date": "2013-01-31T02:53:00Z",
      "name": "Christiane",
      "url": "http://www.vidacycle.com/",
      "comment": "Hola,\n\nJust want to confirm that you will be updating this site to include the <a href=\"http://www.losandes.com.ar/notas/2012/12/16/paso-pehuenche-opcion-para-chile-685977.asp\">new border crossing from Talca</a>, San Clemente over the Andes to Argentina? We drove it almost to the Argentine border yesterday and it's a magnificent new road (highway?).\n\nThe only problem is evidence of many rocks tumbling down onto the road."
    },
    {
      "date": "2013-07-08T13:45:25Z",
      "name": "EJ Bonham",
      "comment": "Hello, Thanks for putting together this information. It will be a huge help in planning trips between Chile and Argentina. I hope to relocate soon to Valdivia, Concepcion or Puerto Montt and one of the primary considerations is being able to travel with relative ease to the lee slope of the Andes in Argentina for the purpose of viewing the scenery in such places as San Martin de los Andes, Esquel and Tierra del Fuego. My joy is secluded hiking in the mountains and amongst nature.\n\nIn your opinion, if you had to choose two of the most scenic routes between the two countries which would they be?"
    }
  ]
}
