{
  "comments": [
    {
      "date": "2011-08-07T06:46:23Z",
      "name": "Vikram",
      "url": "http://vikramvgarg.wordpress.com/",
      "comment": "This collection of statistics and you presentation is impressive, great work. Your analysis of Bollywood and Indian cinema could have been better, though.\n\n<ol>\n<li>The admission figures you have quoted are not for Bollywood. They are for the entire Indian film industry, which comprises of the Hindi, Tamil, Telugu and Bengali language industries, along with the smaller industries of the Kannada, Marathi and Malayalam languages. Of these, Bollywood, the Hindi language industry makes up only of about 40 % of the market. So the correct figure for Bollywood is less than half of what you have quoted.</li>\n<li>To say that your analysis of why Bollywood is popular is inaccurate would be an understatement. It is akin to saying that all Hollywood cinema is exploding cars and gunfights. A cursory look at the plots of <a href=\"http://en.wikipedia.org/wiki/List_of_highest-grossing_Bollywood_films#Highest-grossing_Bollywood_films_throughout_history\">top grossing Hindi movies</a> might give you a better idea of their content.</li>\n<li>Indian cinema has increased its profile in the last decade, however globally it is still a small player as you rightly point out. Interestingly, within India Bollywood's cultural hold <a href=\"http://www.indianexpress.com/news/once-a-shared-space/796422/\">seems to be waning</a>.</li>\n</ol>"
    },
    {
      "date": "2012-03-21T16:02:33Z",
      "name": "Fred Gazendam",
      "url": "http://www.ambic.co.za/",
      "comment": "Here's a link to where one can find <a href=\"http://www.nfvf.co.za\">information on the South African cinema industry</a>. Do have a look because in the \"rainbow nation\" some very interesting dynamics are at play.\n\nFurthermore, it does seem that language plays a key role. Where English is widely spoken, Hollywood very strong and vice versa? We definitely see that in South Africa."
    }
  ]
}
